[PA_MecTechTemplate X2TechTemplate]
DisplayName="Jury Rigged MEC"
Summary="With the parts we brought in, Shen can jury rig a destroyed ADVENT MEC and sideload a gremlin's OS to make it fight for XCOM. ADVENT won't know what hit them."
CodeName="Terminator"
LongDescript="With the parts we brought in, Shen can jury rig a destroyed ADVENT MEC with a gremlin's OS and make it fight for us."

[PA_ViperTechTemplate X2TechTemplate]
DisplayName="Cloned Viper"
Summary="Vipers have such strong regenerative capabilities, they are easy to clone.  Shen can clone fully grown vipers from the bodies we brought in, and train them to fight for us."
CodeName="Slither"
LongDescript="From the viper bodies we brought in, Shen can clone fully grown vipers to fight for us."

[PA_ChrysTechTemplate X2TechTemplate]
DisplayName="Spawned Chryssalid"
Summary="Just like another famous science fiction animal, Chryssalids are always pregnant.  From the Chryssalid bodies we have, Shen was able to work out a way to spawn Chryssalids.  They are easy to train to attack Advent targets."
CodeName="Slasher"
LongDescript="From the Chryssalid bodies we brought in, Shen can spawn fully grown Chryssalids to fight for us."

[PA_MutonTechTemplate X2TechTemplate]
DisplayName="Brainwashed Muton"
Summary="Mutons can be cloned, but it isn't easy.  Fortunately we can also insert psi blocker chips to control them."
CodeName="Slasher"
LongDescript="From the Muton bodies we brought in, Shen can clone fully grown Mutons and brainwash them to be our loyal troops."

[PA_BerserkerTechTemplate X2TechTemplate]
DisplayName="Reprogrammed Berserker"
Summary="Berserkers are quite resilient. Despite the fact we brought back a 'corpse', the scientists believe they can revive and restore it. We would need a decent amount of supplies and other Advent Psionic Tech to successfully reprogram this living tank unit into attacking its former alien masters.""
CodeName="Basher"
LongDescript="From the still twitching Berserker bodies we brought in, the good doctor can revive and reprogram Berserkers to be a terrible new weapon in XCOM's armory."

[Country_Mec X2CountryTemplate]
DisplayName="Mec"
DisplayNameWithArticle="Mec"
DisplayNameWithArticleLower="Mec"
DisplayNamePossessive="Mec's"
DisplayAdjective="Mechanical"

[Country_Viper X2CountryTemplate]
DisplayName="Viper"
DisplayNameWithArticle="Viper"
DisplayNameWithArticleLower="Viper"
DisplayNamePossessive="Viper's"
DisplayAdjective="Viperish"

[Country_Chrys X2CountryTemplate]
DisplayName="Chryssalid"
DisplayNameWithArticle="Chryssalid"
DisplayNameWithArticleLower="Chryssalid"
DisplayNamePossessive="Chryssalid's"
DisplayAdjective="Chryssalid"

[Country_Muton X2CountryTemplate]
DisplayName="Muton"
DisplayNameWithArticle="Muton"
DisplayNameWithArticleLower="Muton"
DisplayNamePossessive="Muton's"
DisplayAdjective="Mutated"

[MecClass X2SoldierClassTemplate]
+DisplayName = "MEC"
+ClassSummary="MECs are a fully robotic ADVENT unit. They have a high damage potential with both their primary weapon and their area-of-effect Micro Missiles. MECs can soak up a lot of damage, but cannot utilize cover."
+LeftAbilityTreeTitle = "Tank"
+RightAbilityTreeTitle = "Artillery"

[ViperClass X2SoldierClassTemplate]
+DisplayName = "Viper"
+ClassSummary="The Viper is an agile and lethal alien unit, generally fit for hit-and-run tactics. Vipers can use their Tongue Pull ability to yank units out of cover, and then use Bind and Crush to incapacitate them."
+LeftAbilityTreeTitle = "Hit"
+RightAbilityTreeTitle = "Run"

[ChrysClass X2SoldierClassTemplate]
+DisplayName = "Chryssalid"
+ClassSummary="The Chryssalid is a terrifying alien unit that can be used to overwhelm enemies. Their main disadvantage is that they only attack from melee range."
+LeftAbilityTreeTitle = "Chryssalid"
+RightAbilityTreeTitle = "Chryssalid"

[MutonClass X2SoldierClassTemplate]
+DisplayName = "Muton"
+ClassSummary="Mutons are more dangerous than ever - tough, and able to deal significant damage.  They are highly effective at close combat."
+LeftAbilityTreeTitle = "Momentum"
+RightAbilityTreeTitle = "Firepower"

[BerserkerClass X2SoldierClassTemplate]
+DisplayName = "Berserker"
+ClassSummary="You thought the Mutons were bad?  Wait until you get a load of these puppies.  Do not bring on stealth missions, they are not stealthy."
+LeftAbilityTreeTitle = "Rage"
+RightAbilityTreeTitle = "Wall of Flesh"

[PA_MecGun X2WeaponTemplate]
FriendlyName="MEC Cannon"
BriefSummary="Weapon salvaged from an ADVENT MEC"
TacticalText="<Bullet/> Salvaged from an ADVENT MEC. <Bullet/> Not usable by human soldiers -- it's too big for them to hold!"
AbilityDescName="MEC cannon"

[PA_MecGunBeam X2WeaponTemplate]
FriendlyName="MEC Plasma Cannon"
BriefSummary="MEC sized plasma rifle"
TacticalText="<Bullet/> Plasma rifle technology applied to MEC sized weapon. <Bullet/> Not usable by human soldiers -- it's too big for them to hold!"
AbilityDescName="MEC beam cannon"

[PA_MecMissile X2WeaponTemplate]
FriendlyName="Micro Missile Launcher"
BriefSummary="Weapon salvaged from an ADVENT MEC"
TacticalText="<Bullet/> Salvaged from an ADVENT MEC. <Bullet/> Not usable by human soldiers -- it's too big for them to hold!"
AbilityDescName="MEC missile launcher"

[PA_MecMissilePlasma X2WeaponTemplate]
FriendlyName="Micro Plasma Missile Launcher"
BriefSummary="Weapon salvaged from an ADVENT MEC, upgraded to plasma technology"
TacticalText="<Bullet/> Salvaged from an ADVENT MEC. <Bullet/> Not usable by human soldiers -- it's too big for them to hold!"
AbilityDescName="MEC plasma missile launcher"

[PA_MegaMissiles X2AbilityTemplate]
LocFriendlyName="Mega Missiles"
LocLongDescription="The MEC's shoulder mounted missile launcher can volley a salvo of missiles that deal high damage in a large area."
LocHelpText="Target an area with an explosive missile attack."

[PA_MutonGun X2WeaponTemplate]
FriendlyName="Muton Beam Rifle"
BriefSummary="Muton Beam Rifle"
TacticalText="<Bullet/>Muton beam weapons are reinforced and mounted with bayonets, so they can be used in melee combat as well."
AbilityDescName="bayonet"

[PA_MutonBayonet X2WeaponTemplate]
FriendlyName="Bayonet"
BriefSummary="Rifle mounted bayonet"
TacticalText="<Bullet/>Muton beam weapons are reinforced and mounted with bayonets, so they can be used in melee combat as well."
AbilityDescName="bayonet"

[PA_ViperTongue X2WeaponTemplate]
FriendlyName="Viper Tongue"
BriefSummary="A Viper's Tongue"
TacticalText="<Bullet/> A Viper's tongue.</br><Bullet/> Not usable by human soldiers -- you can't rip out a Vipers tongue!"
AbilityDescName="Viper Tongue"

[PA_PoisonSpitGlob X2WeaponTemplate]
FriendlyName="Viper Poison Spit"
BriefSummary="A Viper's Poison Spit"
TacticalText="<Bullet/> A Viper's poison spit.</br><Bullet/> Not usable by human soldiers -- you can't drain a Viper's poison glands!"
AbilityDescName="Viper Poison Spit Glob"

[PA_BerserkerDevastatingPunch X2AbilityTemplate]
LocFriendlyName="DevastatingPunch"
LocLongDescription="A melee attack that can disorient the target."
LocHelpText="Attack a melee target with your massive fists, potentially disorienting them."
LocFlyOverText="DevastatingPunch"

[PA_ChrysArmor X2ArmorTemplate]
FriendlyName="Chryssalid Armor Plating"
BriefSummary="Chryssalid Armor Plating"
TacticalText="<Bullet/> A Chryssalid's native armor plating"
AbilityDescName="Chryssalid Armor Plating"

[PA_MecArmor X2ArmorTemplate]
FriendlyName="MEC Armor Plating"
BriefSummary="MEC Armor Plating"
TacticalText="<Bullet/> A MEC's built-in armor plating"
AbilityDescName="MEC Armor Plating"

[PA_MecHeavyArmor X2ArmorTemplate]
FriendlyName="MEC Reinforced Armor Plating"
BriefSummary="MEC Reinforced Armor Plating"
TacticalText="<Bullet/> A MEC's built-in armor plating<Bullet/>Reinforced to support Heavy Weapon mounts"
AbilityDescName="MEC Reinforced Armor Plating"

[PA_MutonArmor X2ArmorTemplate]
FriendlyName="Muton Armor"
BriefSummary="Muton Armor Plating"
TacticalText="<Bullet/> A Muton's standard armor"
AbilityDescName="Muton Armor"

[PA_BerserkerArmor X2ArmorTemplate]
FriendlyName="Berserker Armor"
BriefSummary="Berserker Armor Plating"
TacticalText="<Bullet/> A Berserker's standard armor"
AbilityDescName="Berserker Armor"

[PA_ViperArmor X2ArmorTemplate]
FriendlyName="Viper War Harness"
BriefSummary="Viper War Harness"
TacticalText="<Bullet/> More for appearance than for protection, this is the Viper's war harness"
AbilityDescName="Viper War Harness"

[PA_PoisonSpit X2AbilityTemplate]
LocFriendlyName="Poison Spit"
LocLongDescription="Spit a cloud of poison, dealing 3 damage to affected targets for several turns."
LocHelpText="Spit a cloud of poison, dealing 3 damage to affected targets for several turns."
LocFlyOverText="Poison Spit"
LocPromotionPopupText="<Bullet/> Spit a cloud of poison, dealing 3 damage<br/><Bullet/> Wears off after 1-5 turns.<br/>"

[PA_EnhancedSpit X2AbilityTemplate]
LocFriendlyName="Enhanced Spit"
LocLongDescription="Spit a cloud of poison, dealing 3 damage to affected targets for several turns and applying additional effects."
LocHelpText="Spit a cloud of poison, dealing 3 damage to affected targets for several turns and applying additional effects."
LocFlyOverText="Enhanced Spit"
LocPromotionPopupText="<Bullet/> Spit a cloud of poison, dealing 3 damage and additional effects<br/><Bullet/> Wears off after 1-5 turns.<br/>"

[PA_ViperMolt X2AbilityTemplate]
LocFriendlyName="Molt"
LocLongDescription="You shed your skin, removing the Fire, Acid and Poison conditions."
LocHelpText="You shed your skin, removing the Fire, Acid and Poison conditions."
LocFlyOverText="Molt"
LocPromotionPopupText="Cures Fire, Acid and Poison.<br/><Bullet/> 3 turn cooldown.<br/>"

[PA_ViperBlendIn X2AbilityTemplate]
LocFriendlyName="Blend In"
LocLongDescription="Act normal ... As long as nobody looks too closely, you can sneak around near enemy troops"
LocHelpText="Immediately enter concealment, avoiding direct contact with enemy troops."
LocFlyOverText="Blend In"
LocPromotionPopupText="You can blend in at any location, but the detection radius of enemy troops still applies."

[PA_ViperSlither X2AbilityTemplate]
LocFriendlyName="Slither"
LocLongDescription="Slither forward at high speed for several turns, spoiling enemies' aim"
LocHelpText="Slither forward at high speed for several turns, spoiling enemies' aim"
LocFlyOverText="Slither"
LocPromotionPopupText="Slither forward at high speed for several turns, spoiling enemies' aim"

[PA_ChryssalidSlash X2AbilityTemplate]
LocFriendlyName="Chryssalid Slash"
LocLongDescription="A melee attack that can poison the target."
LocHelpText="Attack a melee target with your claws, potentially poisoning them."
LocFlyOverText="Slash"

[PA_MecDamageControl X2AbilityTemplate]
LocFriendlyName="Damage Control"
LocLongDescription="Built-in servos and nanobots will automatically take action to repair damage, up to a certain limit"
LocHelpText="Automatic repair of damage"
LocFlyOverText="Damage Control"
LocPromotionPopupText="Built-in servos and nanobots will automatically take action to repair damage, up to a certain limit"

[PA_MecJiffyLube X2AbilityTemplate]
LocFriendlyName="Jiffy Lube"
LocLongDescription="When a MEC comes back from a mission, repair parts allow healing at 400% the normal rate"
LocHelpText="Fast healing in repair bay"
LocFlyOverText="Jiffy Lube"
LocPromotionPopupText="When a MEC comes back from a mission, repair parts allow healing at 400% the normal rate"

[PA_MecRegenerate X2AbilityTemplate]
LocFriendlyName="Regenerate"
LocLongDescription="Built-in servos and nanobots can heal damage, including shredded armor"
LocHelpText="Fast healing in combat"
LocFlyOverText="Regenerate"
LocPromotionPopupText="Built-in servos and nanobots can heal damage, including shredded armor"

[PA_MecDrawFire X2AbilityTemplate]
LocFriendlyName="Draw Fire"
LocLongDescription="By hacking into the Advent command network, the Mec can temporarily make itself a high priority target and draw enemy fire."
LocHelpText="Draw enemy fire"
LocFlyOverText="Draw Fire"
LocPromotionPopupText="By hacking into the Advent command network, the Mec can temporarily make itself a high priority target and draw enemy fire."

[MaleVoice1_Silent X2BodyPartTemplate]
DisplayName="No Voice"
[FemaleVoice1_Silent X2BodyPartTemplate]
DisplayName="No Voice"
